OpenFOAM-2.3.x/tutorials/multiphase/interDyMFoam/ras/mixerVesselAMI/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

application=`getApplication`


./Allrun.pre

# Decompose
runApplication decomposePar -force

# Run
runParallel $application 6

# Reconstruct
runApplication reconstructPar -noFunctionObjects

# ----------------------------------------------------------------- end-of-file
